yxgi5/qpc_stm32f103ze-ek/3rd_party/stm32f103ze-ek/Drivers/BSP/stm32f103ze-ek/stm32f103ze_ek.c
//const uint16_t COM_TX_AF[COMn] = {DISCOVERY_COM1_TX_AF};

//const uint16_t COM_RX_AF[COMn] = {DISCOVERY_COM1_RX_AF};

//static I2C_HandleTypeDef hI2cAudioHandler = {0};
//static I2C_HandleTypeDef hI2cExtHandler = {0};
/**
 * @brief BUS variables
 */
//#ifdef HAL_SPI_MODULE_ENABLED
//uint32_t SpixTimeout = EVAL_SPIx_TIMEOUT_MAX;        /*<! Value of Timeout when SPI communication fails */
//static SPI_HandleTypeDef heval_Spi;
//#endif /* HAL_SPI_MODULE_ENABLED */

//#ifdef HAL_I2C_MODULE_ENABLED
//uint32_t I2cxTimeout = EVAL_I2Cx_TIMEOUT_MAX;   /*<! Value of Timeout when I2C communication fails */
//I2C_HandleTypeDef heval_I2c;
//#endif /* HAL_I2C_MODULE_ENABLED */

/**
  * @}
  */

/** @defgroup STM32746G_DISCOVERY_LOW_LEVEL_Private_FunctionPrototypes STM32746G_DISCOVERY_LOW_LEVEL Private Function Prototypes
  * @{
  */

//#if defined(HAL_SRAM_MODULE_ENABLED)

//static void     FSMC_BANK1NORSRAM4_WriteData(uint16_t Data);
//static void     FSMC_BANK1NORSRAM4_WriteReg(uint8_t Reg);
//static uint16_t FSMC_BANK1NORSRAM4_ReadData(uint8_t Reg);
//static void     FSMC_BANK1NORSRAM4_Init(void);
//static void     FSMC_BANK1NORSRAM4_MspInit(void);

/* LCD IO functions */
//void            LCD_IO_Init(void);
//void            LCD_IO_WriteData(uint16_t RegValue);
//void            LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size);
//void            LCD_IO_WriteReg(uint8_t Reg);
//uint16_t        LCD_IO_ReadData(uint16_t Reg);
//void            LCD_Delay (uint32_t delay);
//#endif /*HAL_SRAM_MODULE_ENABLED*/

//static void     I2Cx_MspInit(I2C_HandleTypeDef *i2c_handler);
//static void     I2Cx_Init(I2C_HandleTypeDef *i2c_handler);

//static HAL_StatusTypeDef I2Cx_ReadMultiple(I2C_HandleTypeDef *i2c_handler, uint8_t Addr, uint16_t Reg, uint16_t MemAddSize, uint8_t *Buffer, uint16_t Length);
//static HAL_StatusTypeDef I2Cx_WriteMultiple(I2C_HandleTypeDef *i2c_handler, uint8_t Addr, uint16_t Reg, uint16_t MemAddSize, uint8_t *Buffer, uint16_t Length);
//static HAL_StatusTypeDef I2Cx_IsDeviceReady(I2C_HandleTypeDef *i2c_handler, uint16_t DevAddress, uint32_t Trials);
//static void              I2Cx_Error(I2C_HandleTypeDef *i2c_handler, uint8_t Addr);

/* I2Cx bus function */
//#ifdef HAL_I2C_MODULE_ENABLED
/* Link function for I2C EEPROM peripheral */
//static void               I2Cx_Init(void);
//static void               I2Cx_WriteData(uint16_t Addr, uint8_t Reg, uint8_t Value);
//static HAL_StatusTypeDef  I2Cx_WriteBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
//static uint8_t            I2Cx_ReadData(uint16_t Addr, uint8_t Reg);
//static HAL_StatusTypeDef  I2Cx_ReadBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
//static HAL_StatusTypeDef  I2Cx_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);
//static void               I2Cx_Error (void);
//static void               I2Cx_MspInit(I2C_HandleTypeDef *hi2c);  

/* Link functions for Temperature Sensor peripheral */
//void                      TSENSOR_IO_Init(void);
//void                      TSENSOR_IO_Write(uint16_t DevAddress, uint8_t* pBuffer, uint8_t WriteAddr, uint16_t Length);
//void                      TSENSOR_IO_Read(uint16_t DevAddress, uint8_t* pBuffer, uint8_t ReadAddr, uint16_t Length);
//uint16_t                  TSENSOR_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);

/* Link function for Audio peripheral */
//void                      AUDIO_IO_Init(void);
//void                      AUDIO_IO_DeInit(void);
//void                      AUDIO_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value);
//uint8_t                   AUDIO_IO_Read(uint8_t Addr, uint8_t Reg);

//#endif /* HAL_I2C_MODULE_ENABLED */

/* AUDIO IO functions */
//void            AUDIO_IO_Init(void);
//void            AUDIO_IO_DeInit(void);
//void            AUDIO_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value);
//uint16_t        AUDIO_IO_Read(uint8_t Addr, uint16_t Reg);
//void            AUDIO_IO_Delay(uint32_t Delay);

/* TOUCHSCREEN IO functions */
//void            TS_IO_Init(void);
//void            TS_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value);
//uint8_t         TS_IO_Read(uint8_t Addr, uint8_t Reg);
//void            TS_IO_Delay(uint32_t Delay);

/* CAMERA IO functions */
//void            CAMERA_IO_Init(void);
//void            CAMERA_Delay(uint32_t Delay);
//void            CAMERA_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value);
//uint8_t         CAMERA_IO_Read(uint8_t Addr, uint8_t Reg);

/* I2C EEPROM IO function */
//void                EEPROM_IO_Init(void);
//HAL_StatusTypeDef   EEPROM_IO_WriteData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
//HAL_StatusTypeDef   EEPROM_IO_ReadData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
//HAL_StatusTypeDef   EEPROM_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);


//#ifdef HAL_SPI_MODULE_ENABLED
/* SPIx bus function */
//static HAL_StatusTypeDef  SPIx_Init(void);
//static uint8_t            SPIx_Write(uint8_t Value);
//static uint8_t            SPIx_Read(void);
//static void               SPIx_Error (void);
//static void               SPIx_MspInit(SPI_HandleTypeDef *hspi);

/* Link function for EEPROM peripheral over SPI */
//HAL_StatusTypeDef         FLASH_SPI_IO_Init(void);
//uint8_t                   FLASH_SPI_IO_WriteByte(uint8_t Data);
//uint8_t                   FLASH_SPI_IO_ReadByte(void);
//HAL_StatusTypeDef         FLASH_SPI_IO_ReadData(uint32_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
//void                      FLASH_SPI_IO_WriteEnable(void);
//HAL_StatusTypeDef         FLASH_SPI_IO_WaitForWriteEnd(void);
//uint32_t                  FLASH_SPI_IO_ReadID(void);
//#endif /* HAL_SPI_MODULE_ENABLED */

/**
  * @}
  */

/** @defgroup STM32746G_DISCOVERY_LOW_LEVEL_Exported_Functions STM32746G_DISCOVERY_LOW_LEVELSTM32746G_DISCOVERY_LOW_LEVEL Exported Functions
  * @{
  */

  /**
  * @brief  This method returns the STM32746G DISCOVERY BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t BSP_GetVersion(void)
{
  return __STM32F103ZE_EK_BSP_VERSION;
}

/**
  * @brief  Configures LED on GPIO.
  * @param  Led: LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg LED1
  *            @arg LED2
  *            @arg LED3
  *            @arg LED4
  * @retval None
  */
void BSP_LED_Init(Led_TypeDef Led)
{
//  GPIO_InitTypeDef  gpio_init_structure;
//  GPIO_TypeDef*     gpio_led;

