yxgi5/qpc_stm32f103ze-ek/3rd_party/stm32f103ze-ek/Drivers/BSP/stm32f103ze-ek/stm32f103ze_ek.c
//  if (Led == LED1)
//  {
//    gpio_led = LED1_GPIO_PORT;
    /* Enable the GPIO_LED clock */
//    LED1_GPIO_CLK_ENABLE();

    /* Configure the GPIO_LED pin */
//    gpio_init_structure.Pin = GPIO_PIN[Led];
//    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
//    gpio_init_structure.Pull = GPIO_PULLUP;
//    gpio_init_structure.Speed = GPIO_SPEED_HIGH;

//    HAL_GPIO_Init(gpio_led, &gpio_init_structure);

    /* By default, turn off LED */
//    HAL_GPIO_WritePin(gpio_led, GPIO_PIN[Led], GPIO_PIN_RESET);
//  }
  
  GPIO_InitTypeDef  gpioinitstruct = {0};
  
  /* Enable the GPIO_LED clock */
  LEDx_GPIO_CLK_ENABLE(Led);

  /* Configure the GPIO_LED pin */
  gpioinitstruct.Pin    = LED_PIN[Led];
  gpioinitstruct.Mode   = GPIO_MODE_OUTPUT_PP;
  gpioinitstruct.Pull   = GPIO_NOPULL;
  gpioinitstruct.Speed  = GPIO_SPEED_FREQ_HIGH;

  HAL_GPIO_Init(LED_PORT[Led], &gpioinitstruct);

  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
}

/**
  * @brief  DeInit LEDs.
  * @param  Led: LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  * @note Led DeInit does not disable the GPIO clock
  * @retval None
  */
void BSP_LED_DeInit(Led_TypeDef Led)
{
//  GPIO_InitTypeDef  gpio_init_structure;
//  GPIO_TypeDef*     gpio_led;

//  if (Led == LED1)
//  {
//    gpio_led = LED1_GPIO_PORT;
    /* Turn off LED */
//    HAL_GPIO_WritePin(gpio_led, GPIO_PIN[Led], GPIO_PIN_RESET);
    /* Configure the GPIO_LED pin */
//    gpio_init_structure.Pin = GPIO_PIN[Led];
//    HAL_GPIO_DeInit(gpio_led, gpio_init_structure.Pin);
//  }

  GPIO_InitTypeDef  gpioinitstruct = {0};
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  
  gpioinitstruct.Pin = LED_PIN[Led];
  HAL_GPIO_DeInit(LED_PORT[Led], gpioinitstruct.Pin);
}

/**
  * @brief  Turns selected LED On.
  * @param  Led: LED to be set on
  *          This parameter can be one of the following values:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_On(Led_TypeDef Led)
{
//  GPIO_TypeDef*     gpio_led;

//  if (Led == LED1)    /* Switch On LED connected to GPIO */
//  {
//    gpio_led = LED1_GPIO_PORT;
//    HAL_GPIO_WritePin(gpio_led, GPIO_PIN[Led], GPIO_PIN_SET);
//  }
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led: LED to be set off
  *          This parameter can be one of the following values:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_Off(Led_TypeDef Led)
{
//  GPIO_TypeDef*     gpio_led;

//  if (Led == LED1) /* Switch Off LED connected to GPIO */
//  {
//    gpio_led = LED1_GPIO_PORT;
//    HAL_GPIO_WritePin(gpio_led, GPIO_PIN[Led], GPIO_PIN_RESET);
//  }
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led: LED to be toggled
  *          This parameter can be one of the following values:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_Toggle(Led_TypeDef Led)
{
//  GPIO_TypeDef*     gpio_led;

//  if (Led == LED1)    /* Toggle LED connected to GPIO */
//  {
//    gpio_led = LED1_GPIO_PORT;
//    HAL_GPIO_TogglePin(gpio_led, GPIO_PIN[Led]);
//  }
  HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
}

/**
  * @brief  Configures push button GPIO and EXTI Line.
  * @param  Button: Button to be configured.
  *   This parameter can be one of the following values: 
  *     @arg BUTTON_TAMPER: Key/Tamper Push Button 
  *     @arg BUTTON_SEL   : Sel Push Button on Joystick
  *     @arg BUTTON_LEFT  : Left Push Button on Joystick
  *     @arg BUTTON_RIGHT : Right Push Button on Joystick
  *     @arg BUTTON_DOWN  : Down Push Button on Joystick
  *     @arg BUTTON_UP    : Up Push Button on Joystick
  * @param  Button_Mode: Button mode requested.
  *   This parameter can be one of the following values:   
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO 
  *     @arg BUTTON_MODE_EVT : Button will be connected to EXTI line
  *                            with event generation capability       
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                            with interrupt generation capability
  */
//void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
//{
//  GPIO_InitTypeDef gpio_init_structure;

  /* Enable the BUTTON clock */
//  BUTTONx_GPIO_CLK_ENABLE(Button);

//  if(ButtonMode == BUTTON_MODE_GPIO)
//  {
    /* Configure Button pin as input */
//    gpio_init_structure.Pin = BUTTON_PIN[Button];
//    gpio_init_structure.Mode = GPIO_MODE_INPUT;
//    gpio_init_structure.Pull = GPIO_NOPULL;
//    gpio_init_structure.Speed = GPIO_SPEED_FAST;
//    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);
//  }

//  if(ButtonMode == BUTTON_MODE_EXTI)
//  {
    /* Configure Button pin as input with External interrupt */
//    gpio_init_structure.Pin = BUTTON_PIN[Button];
//    gpio_init_structure.Pull = GPIO_NOPULL;
//    gpio_init_structure.Speed = GPIO_SPEED_FAST;

//    if(Button != BUTTON_WAKEUP)
//    {
//      gpio_init_structure.Mode = GPIO_MODE_IT_FALLING;
//    }
//    else
//    {
//      gpio_init_structure.Mode = GPIO_MODE_IT_RISING;
//    }

//    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
//    HAL_NVIC_SetPriority((IRQn_Type)(BUTTON_IRQn[Button]), 0x0F, 0x00);
//    HAL_NVIC_EnableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
//  }
//}

void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef Button_Mode)
{
  GPIO_InitTypeDef gpioinitstruct = {0};

  /* Enable the corresponding Push Button clock */
  BUTTONx_GPIO_CLK_ENABLE(Button);
  
  /* Configure Push Button pin as input */
  gpioinitstruct.Pin    = BUTTON_PIN[Button];
  gpioinitstruct.Pull   = GPIO_PULLDOWN;
  gpioinitstruct.Speed  = GPIO_SPEED_FREQ_HIGH;
    
