yxgi5/qpc_stm32f103ze-ek/3rd_party/stm32f103ze-ek/Drivers/BSP/stm32f103ze-ek/stm32f103ze_ek.c
  /* Configure USART Rx as alternate function */
  gpio_init_structure.Mode = GPIO_MODE_INPUT;
  gpio_init_structure.Pin = COM_RX_PIN[COM];
  //gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  //gpio_init_structure.Alternate = COM_RX_AF[COM];
  HAL_GPIO_Init(COM_RX_PORT[COM], &gpio_init_structure);

  /* USART configuration */
  huart->Instance = COM_USART[COM];
  HAL_UART_Init(huart);
}
#endif /* HAL_UART_MODULE_ENABLED */

/**
  * @brief  DeInit COM port.
  * @param  COM: COM port to be configured.
  *          This parameter can be one of the following values:
  *            @arg  COM1
  *            @arg  COM2
  * @param  huart: Pointer to a UART_HandleTypeDef structure that contains the
  *                configuration information for the specified USART peripheral.
  * @retval None
  */
void BSP_COM_DeInit(COM_TypeDef COM, UART_HandleTypeDef *huart)
{
  /* USART configuration */
  huart->Instance = COM_USART[COM];
  HAL_UART_DeInit(huart);

  /* Enable USART clock */
//  DISCOVERY_COMx_CLK_DISABLE(COM);
  COMx_CLK_DISABLE(COM);

  /* DeInit GPIO pins can be done in the application
     (by surcharging this __weak function) */

  /* GPIO pins clock, DMA clock can be shut down in the application
     by surcharging this __weak function */
}

/*******************************************************************************
                            BUS OPERATIONS
*******************************************************************************/

///******************************* I2C Routines *********************************/
///**
//  * @brief  Initializes I2C MSP.
//  * @param  i2c_handler : I2C handler
//  * @retval None
//  */
//static void I2Cx_MspInit(I2C_HandleTypeDef *i2c_handler)
//{
//  GPIO_InitTypeDef  gpio_init_structure;
//
//  if (i2c_handler == (I2C_HandleTypeDef*)(&hI2cAudioHandler))
//  {
//    /* AUDIO and LCD I2C MSP init */
//
//    /*** Configure the GPIOs ***/
//    /* Enable GPIO clock */
//    DISCOVERY_AUDIO_I2Cx_SCL_SDA_GPIO_CLK_ENABLE();
//
//    /* Configure I2C Tx as alternate function */
//    gpio_init_structure.Pin = DISCOVERY_AUDIO_I2Cx_SCL_PIN;
//    gpio_init_structure.Mode = GPIO_MODE_AF_OD;
//    gpio_init_structure.Pull = GPIO_NOPULL;
//    gpio_init_structure.Speed = GPIO_SPEED_FAST;
//    gpio_init_structure.Alternate = DISCOVERY_AUDIO_I2Cx_SCL_SDA_AF;
//    HAL_GPIO_Init(DISCOVERY_AUDIO_I2Cx_SCL_SDA_GPIO_PORT, &gpio_init_structure);
//
//    /* Configure I2C Rx as alternate function */
//    gpio_init_structure.Pin = DISCOVERY_AUDIO_I2Cx_SDA_PIN;
//    HAL_GPIO_Init(DISCOVERY_AUDIO_I2Cx_SCL_SDA_GPIO_PORT, &gpio_init_structure);
//
//    /*** Configure the I2C peripheral ***/
//    /* Enable I2C clock */
//    DISCOVERY_AUDIO_I2Cx_CLK_ENABLE();
//
//    /* Force the I2C peripheral clock reset */
//    DISCOVERY_AUDIO_I2Cx_FORCE_RESET();
//
//    /* Release the I2C peripheral clock reset */
//    DISCOVERY_AUDIO_I2Cx_RELEASE_RESET();
//
//    /* Enable and set I2Cx Interrupt to a lower priority */
//    HAL_NVIC_SetPriority(DISCOVERY_AUDIO_I2Cx_EV_IRQn, 0x0F, 0);
//    HAL_NVIC_EnableIRQ(DISCOVERY_AUDIO_I2Cx_EV_IRQn);
//
//    /* Enable and set I2Cx Interrupt to a lower priority */
//    HAL_NVIC_SetPriority(DISCOVERY_AUDIO_I2Cx_ER_IRQn, 0x0F, 0);
//    HAL_NVIC_EnableIRQ(DISCOVERY_AUDIO_I2Cx_ER_IRQn);
//  }
//  else
//  {
//    /* External, camera and Arduino connector I2C MSP init */
//
//    /*** Configure the GPIOs ***/
//    /* Enable GPIO clock */
//    DISCOVERY_EXT_I2Cx_SCL_SDA_GPIO_CLK_ENABLE();
//
//    /* Configure I2C Tx as alternate function */
//    gpio_init_structure.Pin = DISCOVERY_EXT_I2Cx_SCL_PIN;
//    gpio_init_structure.Mode = GPIO_MODE_AF_OD;
//    gpio_init_structure.Pull = GPIO_NOPULL;
//    gpio_init_structure.Speed = GPIO_SPEED_FAST;
//    gpio_init_structure.Alternate = DISCOVERY_EXT_I2Cx_SCL_SDA_AF;
//    HAL_GPIO_Init(DISCOVERY_EXT_I2Cx_SCL_SDA_GPIO_PORT, &gpio_init_structure);
//
//    /* Configure I2C Rx as alternate function */
//    gpio_init_structure.Pin = DISCOVERY_EXT_I2Cx_SDA_PIN;
//    HAL_GPIO_Init(DISCOVERY_EXT_I2Cx_SCL_SDA_GPIO_PORT, &gpio_init_structure);
//
//    /*** Configure the I2C peripheral ***/
//    /* Enable I2C clock */
//    DISCOVERY_EXT_I2Cx_CLK_ENABLE();
//
//    /* Force the I2C peripheral clock reset */
//    DISCOVERY_EXT_I2Cx_FORCE_RESET();
//
//    /* Release the I2C peripheral clock reset */
//    DISCOVERY_EXT_I2Cx_RELEASE_RESET();
//
//    /* Enable and set I2Cx Interrupt to a lower priority */
//    HAL_NVIC_SetPriority(DISCOVERY_EXT_I2Cx_EV_IRQn, 0x0F, 0);
//    HAL_NVIC_EnableIRQ(DISCOVERY_EXT_I2Cx_EV_IRQn);
//
//    /* Enable and set I2Cx Interrupt to a lower priority */
//    HAL_NVIC_SetPriority(DISCOVERY_EXT_I2Cx_ER_IRQn, 0x0F, 0);
//    HAL_NVIC_EnableIRQ(DISCOVERY_EXT_I2Cx_ER_IRQn);
//  }
//}
//
///**
//  * @brief  Initializes I2C HAL.
//  * @param  i2c_handler : I2C handler
//  * @retval None
//  */
//static void I2Cx_Init(I2C_HandleTypeDef *i2c_handler)
//{
//  if(HAL_I2C_GetState(i2c_handler) == HAL_I2C_STATE_RESET)
//  {
//    if (i2c_handler == (I2C_HandleTypeDef*)(&hI2cAudioHandler))
//    {
//      /* Audio and LCD I2C configuration */
//      i2c_handler->Instance = DISCOVERY_AUDIO_I2Cx;
//    }
//    else
//    {
//      /* External, camera and Arduino connector  I2C configuration */
//      i2c_handler->Instance = DISCOVERY_EXT_I2Cx;
//    }
//    i2c_handler->Init.Timing           = DISCOVERY_I2Cx_TIMING;
//    i2c_handler->Init.OwnAddress1      = 0;
//    i2c_handler->Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
//    i2c_handler->Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
//    i2c_handler->Init.OwnAddress2      = 0;
//    i2c_handler->Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
//    i2c_handler->Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;
//
//    /* Init the I2C */
//    I2Cx_MspInit(i2c_handler);
//    HAL_I2C_Init(i2c_handler);
//  }
//}
//
///**
//  * @brief  Reads multiple data.
//  * @param  i2c_handler : I2C handler
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @param  MemAddress: Memory address
//  * @param  Buffer: Pointer to data buffer
//  * @param  Length: Length of the data
//  * @retval Number of read data
//  */
//static HAL_StatusTypeDef I2Cx_ReadMultiple(I2C_HandleTypeDef *i2c_handler,
//                                           uint8_t Addr,
//                                           uint16_t Reg,
//                                           uint16_t MemAddress,
//                                           uint8_t *Buffer,
//                                           uint16_t Length)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//
//  status = HAL_I2C_Mem_Read(i2c_handler, Addr, (uint16_t)Reg, MemAddress, Buffer, Length, 1000);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* I2C error occurred */
//    I2Cx_Error(i2c_handler, Addr);
//  }
//  return status;
//}
//
///**
//  * @brief  Writes a value in a register of the device through BUS in using DMA mode.
//  * @param  i2c_handler : I2C handler
//  * @param  Addr: Device address on BUS Bus.
//  * @param  Reg: The target register address to write
//  * @param  MemAddress: Memory address
//  * @param  Buffer: The target register value to be written
//  * @param  Length: buffer size to be written
//  * @retval HAL status
//  */
//static HAL_StatusTypeDef I2Cx_WriteMultiple(I2C_HandleTypeDef *i2c_handler,
//                                            uint8_t Addr,
//                                            uint16_t Reg,
//                                            uint16_t MemAddress,
//                                            uint8_t *Buffer,
//                                            uint16_t Length)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//
//  status = HAL_I2C_Mem_Write(i2c_handler, Addr, (uint16_t)Reg, MemAddress, Buffer, Length, 1000);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Re-Initiaize the I2C Bus */
//    I2Cx_Error(i2c_handler, Addr);
//  }
//  return status;
//}
//
///**
//  * @brief  Checks if target device is ready for communication.
//  * @note   This function is used with Memory devices
//  * @param  i2c_handler : I2C handler
//  * @param  DevAddress: Target device address
//  * @param  Trials: Number of trials
//  * @retval HAL status
//  */
//static HAL_StatusTypeDef I2Cx_IsDeviceReady(I2C_HandleTypeDef *i2c_handler, uint16_t DevAddress, uint32_t Trials)
//{
//  return (HAL_I2C_IsDeviceReady(i2c_handler, DevAddress, Trials, 1000));
//}
//
///**
//  * @brief  Manages error callback by re-initializing I2C.
//  * @param  i2c_handler : I2C handler
//  * @param  Addr: I2C Address
//  * @retval None
//  */
//static void I2Cx_Error(I2C_HandleTypeDef *i2c_handler, uint8_t Addr)
//{
//  /* De-initialize the I2C communication bus */
//  HAL_I2C_DeInit(i2c_handler);
//
//  /* Re-Initialize the I2C communication bus */
//  I2Cx_Init(i2c_handler);
//}
//
///*******************************************************************************
//                            LINK OPERATIONS
//*******************************************************************************/
//
///********************************* LINK AUDIO *********************************/
//
///**
//  * @brief  Initializes Audio low level.
//  * @retval None
//  */
//void AUDIO_IO_Init(void)
//{
//  I2Cx_Init(&hI2cAudioHandler);
//}
//
///**
//  * @brief  Deinitializes Audio low level.
//  * @retval None
//  */
//void AUDIO_IO_DeInit(void)
//{
//}
//
///**
//  * @brief  Writes a single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @param  Value: Data to be written
//  * @retval None
//  */
//void AUDIO_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value)
//{
//  uint16_t tmp = Value;
//
//  Value = ((uint16_t)(tmp >> 8) & 0x00FF);
//
//  Value |= ((uint16_t)(tmp << 8)& 0xFF00);
//
//  I2Cx_WriteMultiple(&hI2cAudioHandler, Addr, Reg, I2C_MEMADD_SIZE_16BIT,(uint8_t*)&Value, 2);
//}
//
///**
//  * @brief  Reads a single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @retval Data to be read
//  */
//uint16_t AUDIO_IO_Read(uint8_t Addr, uint16_t Reg)
//{
//  uint16_t read_value = 0, tmp = 0;
//
//  I2Cx_ReadMultiple(&hI2cAudioHandler, Addr, Reg, I2C_MEMADD_SIZE_16BIT, (uint8_t*)&read_value, 2);
//
//  tmp = ((uint16_t)(read_value >> 8) & 0x00FF);
//
//  tmp |= ((uint16_t)(read_value << 8)& 0xFF00);
//
//  read_value = tmp;
//
//  return read_value;
//}
//
///**
//  * @brief  AUDIO Codec delay
//  * @param  Delay: Delay in ms
//  * @retval None
//  */
//void AUDIO_IO_Delay(uint32_t Delay)
//{
//  HAL_Delay(Delay);
//}
//
///********************************* LINK CAMERA ********************************/
//
///**
//  * @brief  Initializes Camera low level.
//  * @retval None
//  */
//void CAMERA_IO_Init(void)
//{
//  I2Cx_Init(&hI2cExtHandler);
//}
//
///**
//  * @brief  Camera writes single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Register address
//  * @param  Value: Data to be written
//  * @retval None
//  */
//void CAMERA_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value)
//{
//  I2Cx_WriteMultiple(&hI2cExtHandler, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT,(uint8_t*)&Value, 1);
//}
//
///**
//  * @brief  Camera reads single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Register address
//  * @retval Read data
//  */
//uint8_t CAMERA_IO_Read(uint8_t Addr, uint8_t Reg)
//{
//  uint8_t read_value = 0;
//
//  I2Cx_ReadMultiple(&hI2cExtHandler, Addr, Reg, I2C_MEMADD_SIZE_8BIT, (uint8_t*)&read_value, 1);
//
//  return read_value;
//}
//
///**
//  * @brief  Camera delay
//  * @param  Delay: Delay in ms
//  * @retval None
//  */
//void CAMERA_Delay(uint32_t Delay)
//{
//  HAL_Delay(Delay);
//}
//
///******************************** LINK I2C EEPROM *****************************/
//
///**
//  * @brief  Initializes peripherals used by the I2C EEPROM driver.
//  * @retval None
//  */
//void EEPROM_IO_Init(void)
//{
//  I2Cx_Init(&hI2cExtHandler);
//}
//
///**
//  * @brief  Write data to I2C EEPROM driver in using DMA channel.
//  * @param  DevAddress: Target device address
//  * @param  MemAddress: Internal memory address
//  * @param  pBuffer: Pointer to data buffer
//  * @param  BufferSize: Amount of data to be sent
//  * @retval HAL status
//  */
//HAL_StatusTypeDef EEPROM_IO_WriteData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
//{
//  return (I2Cx_WriteMultiple(&hI2cExtHandler, DevAddress, MemAddress, I2C_MEMADD_SIZE_16BIT, pBuffer, BufferSize));
//}
//
///**
//  * @brief  Read data from I2C EEPROM driver in using DMA channel.
//  * @param  DevAddress: Target device address
//  * @param  MemAddress: Internal memory address
//  * @param  pBuffer: Pointer to data buffer
//  * @param  BufferSize: Amount of data to be read
//  * @retval HAL status
//  */
//HAL_StatusTypeDef EEPROM_IO_ReadData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
//{
//  return (I2Cx_ReadMultiple(&hI2cExtHandler, DevAddress, MemAddress, I2C_MEMADD_SIZE_16BIT, pBuffer, BufferSize));
//}
//
///**
//  * @brief  Checks if target device is ready for communication.
//  * @note   This function is used with Memory devices
//  * @param  DevAddress: Target device address
//  * @param  Trials: Number of trials
//  * @retval HAL status
//  */
//HAL_StatusTypeDef EEPROM_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
//{
//  return (I2Cx_IsDeviceReady(&hI2cExtHandler, DevAddress, Trials));
//}
//
///********************************* LINK TOUCHSCREEN *********************************/
//
///**
//  * @brief  Initializes Touchscreen low level.
//  * @retval None
//  */
//void TS_IO_Init(void)
//{
//  I2Cx_Init(&hI2cAudioHandler);
//}
//
///**
//  * @brief  Writes a single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @param  Value: Data to be written
//  * @retval None
//  */
//void TS_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value)
//{
//  I2Cx_WriteMultiple(&hI2cAudioHandler, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT,(uint8_t*)&Value, 1);
//}
//
///**
//  * @brief  Reads a single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @retval Data to be read
//  */
//uint8_t TS_IO_Read(uint8_t Addr, uint8_t Reg)
//{
//  uint8_t read_value = 0;
//
//  I2Cx_ReadMultiple(&hI2cAudioHandler, Addr, Reg, I2C_MEMADD_SIZE_8BIT, (uint8_t*)&read_value, 1);
//
//  return read_value;
//}
//
///**
//  * @brief  TS delay
//  * @param  Delay: Delay in ms
//  * @retval None
//  */
//void TS_IO_Delay(uint32_t Delay)
//{
//  HAL_Delay(Delay);
//}
//
//
///*******************************************************************************
//                            BUS OPERATIONS
//*******************************************************************************/
//
///*************************** FSMC Routines ************************************/
//#if defined(HAL_SRAM_MODULE_ENABLED)
///**
//  * @brief  Initializes FSMC_BANK4 MSP.
//  */
//static void FSMC_BANK1NORSRAM4_MspInit(void)
//{
//  GPIO_InitTypeDef gpioinitstruct = {0};
//
//  /* Enable FMC clock */
//  __HAL_RCC_FSMC_CLK_ENABLE();
//
//  /* Enable GPIOs clock */
//  __HAL_RCC_GPIOD_CLK_ENABLE();
//  __HAL_RCC_GPIOE_CLK_ENABLE();
//  __HAL_RCC_GPIOF_CLK_ENABLE();
//  __HAL_RCC_GPIOG_CLK_ENABLE();
//  __HAL_RCC_AFIO_CLK_ENABLE();
//
//  /* Common GPIO configuration */
//  gpioinitstruct.Mode      = GPIO_MODE_AF_PP;
//  gpioinitstruct.Speed     = GPIO_SPEED_FREQ_HIGH;
//
//  /* Set PD.00(D2), PD.01(D3), PD.04(NOE), PD.05(NWE), PD.08(D13), PD.09(D14),
//     PD.10(D15), PD.14(D0), PD.15(D1) as alternate function push pull */
//  gpioinitstruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5 |
//                                GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_14 |
//                                GPIO_PIN_15;
//  HAL_GPIO_Init(GPIOD, &gpioinitstruct);
//
//  /* Set PE.07(D4), PE.08(D5), PE.09(D6), PE.10(D7), PE.11(D8), PE.12(D9), PE.13(D10),
//     PE.14(D11), PE.15(D12) as alternate function push pull */
//  gpioinitstruct.Pin = GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 |
//                                GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 |
//                                GPIO_PIN_15;
//  HAL_GPIO_Init(GPIOE, &gpioinitstruct);
//
//  /* Set PF.00(A0 (RS)) as alternate function push pull */
//  gpioinitstruct.Pin = GPIO_PIN_0;
//  HAL_GPIO_Init(GPIOF, &gpioinitstruct);
//
//  /* Set PG.12(NE4 (LCD/CS)) as alternate function push pull - CE3(LCD /CS) */
//  gpioinitstruct.Pin = GPIO_PIN_12;
//  HAL_GPIO_Init(GPIOG, &gpioinitstruct);
//}
//
///**
//  * @brief  Initializes LCD IO.
//  */
//static void FSMC_BANK1NORSRAM4_Init(void)
//{
//  SRAM_HandleTypeDef          hsram;
//  FSMC_NORSRAM_TimingTypeDef  sramtiming = {0};
//
//  /*** Configure the SRAM Bank 4 ***/
//  /* Configure IPs */
//  hsram.Instance  = FSMC_NORSRAM_DEVICE;
//  hsram.Extended  = FSMC_NORSRAM_EXTENDED_DEVICE;
//
//  sramtiming.AddressSetupTime       = 1;
//  sramtiming.AddressHoldTime        = 1;
//  sramtiming.DataSetupTime          = 2;
//  sramtiming.BusTurnAroundDuration  = 1;
//  sramtiming.CLKDivision            = 2;
//  sramtiming.DataLatency            = 2;
//  sramtiming.AccessMode             = FSMC_ACCESS_MODE_A;
//
//  /* Color LCD configuration
//     LCD configured as follow:
//        - Data/Address MUX = Disable
//        - Memory Type = SRAM
//        - Data Width = 16bit
//        - Write Operation = Enable
//        - Extended Mode = Enable
//        - Asynchronous Wait = Disable */
//  hsram.Init.NSBank             = FSMC_NORSRAM_BANK4;
//  hsram.Init.DataAddressMux     = FSMC_DATA_ADDRESS_MUX_DISABLE;
//  hsram.Init.MemoryType         = FSMC_MEMORY_TYPE_SRAM;
//  hsram.Init.MemoryDataWidth    = FSMC_NORSRAM_MEM_BUS_WIDTH_16;
//  hsram.Init.BurstAccessMode    = FSMC_BURST_ACCESS_MODE_DISABLE;
//  hsram.Init.WaitSignalPolarity = FSMC_WAIT_SIGNAL_POLARITY_LOW;
//  hsram.Init.WrapMode           = FSMC_WRAP_MODE_DISABLE;
//  hsram.Init.WaitSignalActive   = FSMC_WAIT_TIMING_BEFORE_WS;
//  hsram.Init.WriteOperation     = FSMC_WRITE_OPERATION_ENABLE;
//  hsram.Init.WaitSignal         = FSMC_WAIT_SIGNAL_DISABLE;
//  hsram.Init.ExtendedMode       = FSMC_EXTENDED_MODE_DISABLE;
//  hsram.Init.AsynchronousWait   = FSMC_ASYNCHRONOUS_WAIT_DISABLE;
//  hsram.Init.WriteBurst         = FSMC_WRITE_BURST_DISABLE;
//
//  /* Initialize the SRAM controller */
//  FSMC_BANK1NORSRAM4_MspInit();
//  HAL_SRAM_Init(&hsram, &sramtiming, &sramtiming);
//}
//
///**
//  * @brief  Writes register value.
//  */
//static void FSMC_BANK1NORSRAM4_WriteData(uint16_t Data)
//{
//  /* Write 16-bit Data */
//  TFT_LCD->RAM = Data;
//}
//
///**
//  * @brief  Writes register address.
//  * @param  Reg:
//  * @retval None
//  */
//static void FSMC_BANK1NORSRAM4_WriteReg(uint8_t Reg)
//{
//  /* Write 16-bit Index, then Write Reg */
//  TFT_LCD->REG = Reg;
//}
//
///**
//  * @brief  Reads register value.
//  * @retval Read value
//  */
//static uint16_t FSMC_BANK1NORSRAM4_ReadData(uint8_t Reg)
//{
//  /* Write 16-bit Index (then Read Reg) */
//  TFT_LCD->REG = Reg;
//  /* Read 16-bit Reg */
//  return (TFT_LCD->RAM);
//}
//#endif /*HAL_SRAM_MODULE_ENABLED*/
//
//#ifdef HAL_I2C_MODULE_ENABLED
///******************************* I2C Routines**********************************/
//
///**
//  * @brief Eval I2Cx MSP Initialization
//  * @param hi2c: I2C handle
//  */
//static void I2Cx_MspInit(I2C_HandleTypeDef *hi2c)
//{
//  GPIO_InitTypeDef  gpioinitstruct = {0};
//
//  if (hi2c->Instance == EVAL_I2Cx)
//  {
//    /*## Configure the GPIOs ################################################*/
//
//    /* Enable GPIO clock */
//    EVAL_I2Cx_SDA_GPIO_CLK_ENABLE();
//    EVAL_I2Cx_SCL_GPIO_CLK_ENABLE();
//
//    /* Configure I2C Tx as alternate function  */
//    gpioinitstruct.Pin       = EVAL_I2Cx_SCL_PIN;
//    gpioinitstruct.Mode      = GPIO_MODE_AF_OD;
//    gpioinitstruct.Pull      = GPIO_NOPULL;
//    gpioinitstruct.Speed     = GPIO_SPEED_FREQ_HIGH;
//    HAL_GPIO_Init(EVAL_I2Cx_SCL_GPIO_PORT, &gpioinitstruct);
//
//    /* Configure I2C Rx as alternate function  */
//    gpioinitstruct.Pin = EVAL_I2Cx_SDA_PIN;
//    HAL_GPIO_Init(EVAL_I2Cx_SDA_GPIO_PORT, &gpioinitstruct);
//
//
//    /*## Configure the Eval I2Cx peripheral #######################################*/
//    /* Enable Eval_I2Cx clock */
//    EVAL_I2Cx_CLK_ENABLE();
//
//    /* Add delay related to RCC workaround */
//    while (READ_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C1EN) != RCC_APB1ENR_I2C1EN) {};
//
//    /* Force the I2C Periheral Clock Reset */
//    EVAL_I2Cx_FORCE_RESET();
//
//    /* Release the I2C Periheral Clock Reset */
//    EVAL_I2Cx_RELEASE_RESET();
//
//    /* Enable and set Eval I2Cx Interrupt to the highest priority */
//    HAL_NVIC_SetPriority(EVAL_I2Cx_EV_IRQn, 0xE, 0);
//    HAL_NVIC_EnableIRQ(EVAL_I2Cx_EV_IRQn);
//
//    /* Enable and set Eval I2Cx Interrupt to the highest priority */
//    HAL_NVIC_SetPriority(EVAL_I2Cx_ER_IRQn, 0xE, 0);
//    HAL_NVIC_EnableIRQ(EVAL_I2Cx_ER_IRQn);
//  }
//}
//
///**
//  * @brief Eval I2Cx Bus initialization
//  */
//static void I2Cx_Init(void)
//{
//  if(HAL_I2C_GetState(&heval_I2c) == HAL_I2C_STATE_RESET)
//  {
//    heval_I2c.Instance              = EVAL_I2Cx;
//    heval_I2c.Init.ClockSpeed       = BSP_I2C_SPEED;
//    heval_I2c.Init.DutyCycle        = I2C_DUTYCYCLE_2;
//    heval_I2c.Init.OwnAddress1      = 0;
//    heval_I2c.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
//    heval_I2c.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
//    heval_I2c.Init.OwnAddress2      = 0;
//    heval_I2c.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
//    heval_I2c.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;
//
//    /* Init the I2C */
//    I2Cx_MspInit(&heval_I2c);
//    HAL_I2C_Init(&heval_I2c);
//  }
//}
//
///**
//  * @brief  Write a value in a register of the device through BUS.
//  * @param  Addr: Device address on BUS Bus.
//  * @param  Reg: The target register address to write
//  * @param  Value: The target register value to be written
//  */
//static void I2Cx_WriteData(uint16_t Addr, uint8_t Reg, uint8_t Value)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//
//  status = HAL_I2C_Mem_Write(&heval_I2c, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT, &Value, 1, I2cxTimeout);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Execute user timeout callback */
//    I2Cx_Error();
//  }
//}
//
///**
//  * @brief  Write a value in a register of the device through BUS.
//  * @param  Addr: Device address on BUS Bus.
//  * @param  Reg: The target register address to write
//  * @param  RegSize: The target register size (can be 8BIT or 16BIT)
//  * @param  pBuffer: The target register value to be written
//  * @param  Length: buffer size to be written
//  */
//static HAL_StatusTypeDef I2Cx_WriteBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//
//  status = HAL_I2C_Mem_Write(&heval_I2c, Addr, (uint16_t)Reg, RegSize, pBuffer, Length, I2cxTimeout);
//
///* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Re-Initiaize the BUS */
//    I2Cx_Error();
//  }
//  return status;
//}
//
///**
//  * @brief  Read a value in a register of the device through BUS.
//  * @param  Addr: Device address on BUS Bus.
//  * @param  Reg: The target register address to write
//  * @retval Data read at register @
//  */
//static uint8_t I2Cx_ReadData(uint16_t Addr, uint8_t Reg)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//  uint8_t value = 0;
//
//  status = HAL_I2C_Mem_Read(&heval_I2c, Addr, Reg, I2C_MEMADD_SIZE_8BIT, &value, 1, I2cxTimeout);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Execute user timeout callback */
//    I2Cx_Error();
//
//  }
//  return value;
//}
//
///**
