yxgi5/qpc_stm32f103ze-ek/3rd_party/stm32f103ze-ek/Drivers/BSP/stm32f103ze-ek/stm32f103ze_ek.c
//  * @brief  Reads multiple data on the BUS.
//  * @param  Addr: I2C Address
//  * @param  Reg: Reg Address
//  * @param  RegSize : The target register size (can be 8BIT or 16BIT)
//  * @param  pBuffer: pointer to read data buffer
//  * @param  Length: length of the data
//  * @retval 0 if no problems to read multiple data
//  */
//static HAL_StatusTypeDef I2Cx_ReadBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//
//  status = HAL_I2C_Mem_Read(&heval_I2c, Addr, (uint16_t)Reg, RegSize, pBuffer, Length, I2cxTimeout);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Re-Initiaize the BUS */
//    I2Cx_Error();
//  }
//  return status;
//}
//
///**
//* @brief  Checks if target device is ready for communication.
//* @note   This function is used with Memory devices
//* @param  DevAddress: Target device address
//* @param  Trials: Number of trials
//* @retval HAL status
//*/
//static HAL_StatusTypeDef I2Cx_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
//{
//  return (HAL_I2C_IsDeviceReady(&heval_I2c, DevAddress, Trials, I2cxTimeout));
//}
//
//
///**
//  * @brief Eval I2Cx error treatment function
//  * @retval None
//  */
//static void I2Cx_Error (void)
//{
//  /* De-initialize the I2C communication BUS */
//  HAL_I2C_DeInit(&heval_I2c);
//
//  /* Re- Initiaize the I2C communication BUS */
//  I2Cx_Init();
//}
//
//#endif /* HAL_I2C_MODULE_ENABLED */
//
///******************************* SPI Routines**********************************/
//#ifdef HAL_SPI_MODULE_ENABLED
///**
//  * @brief  Initializes SPI MSP.
//  */
//static void SPIx_MspInit(SPI_HandleTypeDef *hspi)
//{
//  GPIO_InitTypeDef  gpioinitstruct = {0};
//
//  /*** Configure the GPIOs ***/
//  /* Enable GPIO clock */
//  EVAL_SPIx_SCK_GPIO_CLK_ENABLE();
//  EVAL_SPIx_MISO_MOSI_GPIO_CLK_ENABLE();
//
//  /* configure SPI SCK */
//  gpioinitstruct.Pin        = EVAL_SPIx_SCK_PIN;
//  gpioinitstruct.Mode       = GPIO_MODE_AF_PP;
//  gpioinitstruct.Pull       = GPIO_NOPULL;
//  gpioinitstruct.Speed      = GPIO_SPEED_FREQ_HIGH;
//  HAL_GPIO_Init(EVAL_SPIx_SCK_GPIO_PORT, &gpioinitstruct);
//
//  /* configure SPI MISO and MOSI */
//  gpioinitstruct.Pin        = (EVAL_SPIx_MISO_PIN | EVAL_SPIx_MOSI_PIN);
//  gpioinitstruct.Mode       = GPIO_MODE_AF_PP;
//  gpioinitstruct.Pull       = GPIO_NOPULL;
//  gpioinitstruct.Speed      = GPIO_SPEED_FREQ_HIGH;
//  HAL_GPIO_Init(EVAL_SPIx_MISO_MOSI_GPIO_PORT, &gpioinitstruct);
//
//  /*** Configure the SPI peripheral ***/
//  /* Enable SPI clock */
//  EVAL_SPIx_CLK_ENABLE();
//}
//
///**
//  * @brief  Initializes SPI HAL.
//  */
//HAL_StatusTypeDef SPIx_Init(void)
//{
//  /* DeInitializes the SPI peripheral */
//  heval_Spi.Instance = EVAL_SPIx;
//  HAL_SPI_DeInit(&heval_Spi);
//
//  /* SPI Config */
//  /* SPI baudrate is set to 36 MHz (PCLK2/SPI_BaudRatePrescaler = 72/2 = 36 MHz) */
//  heval_Spi.Init.BaudRatePrescaler  = SPI_BAUDRATEPRESCALER_2;
//  heval_Spi.Init.Direction          = SPI_DIRECTION_2LINES;
//  heval_Spi.Init.CLKPhase           = SPI_PHASE_1EDGE;
//  heval_Spi.Init.CLKPolarity        = SPI_POLARITY_LOW;
//  heval_Spi.Init.CRCCalculation     = SPI_CRCCALCULATION_DISABLE;
//  heval_Spi.Init.CRCPolynomial      = 7;
//  heval_Spi.Init.DataSize           = SPI_DATASIZE_8BIT;
//  heval_Spi.Init.FirstBit           = SPI_FIRSTBIT_MSB;
//  heval_Spi.Init.NSS                = SPI_NSS_SOFT;
//  heval_Spi.Init.TIMode             = SPI_TIMODE_DISABLE;
//  heval_Spi.Init.Mode               = SPI_MODE_MASTER;
//
//  SPIx_MspInit(&heval_Spi);
//
//  return (HAL_SPI_Init(&heval_Spi));
//}
//
//
///**
//  * @brief  SPI Write a byte to device
//  * @param  WriteValue to be written
//  * @retval The value of the received byte.
//  */
//static uint8_t SPIx_Write(uint8_t WriteValue)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//  uint8_t ReadValue = 0;
//
//  status = HAL_SPI_TransmitReceive(&heval_Spi, (uint8_t*) &WriteValue, (uint8_t*) &ReadValue, 1, SpixTimeout);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Execute user timeout callback */
//    SPIx_Error();
//  }
//
//   return ReadValue;
//}
//
//
///**
//  * @brief SPI Read 1 byte from device
//  * @retval Read data
//*/
//static uint8_t SPIx_Read(void)
//{
//  return (SPIx_Write(FLASH_SPI_DUMMY_BYTE));
//}
//
//
///**
//  * @brief SPI error treatment function
//  */
//static void SPIx_Error (void)
//{
//  /* De-initialize the SPI communication BUS */
//  HAL_SPI_DeInit(&heval_Spi);
//
//  /* Re- Initiaize the SPI communication BUS */
//  SPIx_Init();
//}
//#endif /* HAL_SPI_MODULE_ENABLED */
//
///**
//  * @}
//  */
//
///** @defgroup STM3210E_EVAL_LinkOperations_Functions STM3210E EVAL LinkOperations Functions
//  * @{
//  */
//
///*******************************************************************************
//                            LINK OPERATIONS
//*******************************************************************************/
//
//#if defined(HAL_SRAM_MODULE_ENABLED)
///********************************* LINK LCD ***********************************/
//
///**
//  * @brief  Initializes LCD low level.
//  */
//void LCD_IO_Init(void)
//{
//  FSMC_BANK1NORSRAM4_Init();
//}
//
///**
//  * @brief  Writes data on LCD data register.
//  * @param  RegValue: Data to be written
//  * @retval None
//  */
//void  LCD_IO_WriteData(uint16_t RegValue)
//{
//    FSMC_BANK1NORSRAM4_WriteData(RegValue);
//}
//
///**
//  * @brief  Writes multiple data on LCD data register.
//  * @param  pData: Data to be written
//  * @param  Size: number of data to write
//  */
//void LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size)
//{
//  uint32_t counter = 0;
//  uint16_t regvalue;
//
//  regvalue = *pData | (*(pData+1) << 8);
//
//  for (counter = Size; counter != 0; counter--)
//  {
//    /* Write 16-bit Reg */
//    FSMC_BANK1NORSRAM4_WriteData(regvalue);
//    counter--;
//    pData += 2;
//    regvalue = *pData | (*(pData+1) << 8);
//  }
//}
//
///**
//  * @brief  Writes register on LCD register.
//  * @param  Reg: Register to be written
//  */
//void LCD_IO_WriteReg(uint8_t Reg)
//{
//  FSMC_BANK1NORSRAM4_WriteReg(Reg);
//}
//
///**
//  * @brief  Reads data from LCD data register.
//  * @param  Reg: Register to be read
//  * @retval Read data.
//  */
//uint16_t LCD_IO_ReadData(uint16_t Reg)
//{
//  /* Read 16-bit Reg */
//  return (FSMC_BANK1NORSRAM4_ReadData(Reg));
//}
//
///**
//  * @brief  Wait for loop in ms.
//  * @param  Delay in ms.
//  */
//void LCD_Delay (uint32_t Delay)
//{
//  HAL_Delay(Delay);
//}
//
//#endif /*HAL_SRAM_MODULE_ENABLED*/
//
//#ifdef HAL_SPI_MODULE_ENABLED
///******************************** LINK FLASH SPI ********************************/
///**
//  * @brief  Initializes the FLASH SPI and put it into StandBy State (Ready for
//  *         data transfer).
//  */
//HAL_StatusTypeDef FLASH_SPI_IO_Init(void)
//{
//  HAL_StatusTypeDef Status = HAL_OK;
//
//  GPIO_InitTypeDef  gpioinitstruct = {0};
//
//  /* EEPROM_CS_GPIO Periph clock enable */
//  FLASH_SPI_CS_GPIO_CLK_ENABLE();
//
//  /* Configure EEPROM_CS_PIN pin: EEPROM SPI CS pin */
//  gpioinitstruct.Pin    = FLASH_SPI_CS_PIN;
//  gpioinitstruct.Mode   = GPIO_MODE_OUTPUT_PP;
//  gpioinitstruct.Pull   = GPIO_PULLUP;
//  gpioinitstruct.Speed  = GPIO_SPEED_FREQ_HIGH;
//  HAL_GPIO_Init(FLASH_SPI_CS_GPIO_PORT, &gpioinitstruct);
//
//  /* SPI FLASH Config */
//  Status = SPIx_Init();
//
//  /* EEPROM chip select high */
//  FLASH_SPI_CS_HIGH();
//
//  return Status;
//}
//
///**
//  * @brief  Write a byte on the FLASH SPI.
//  * @param  Data: byte to send.
//  */
//uint8_t FLASH_SPI_IO_WriteByte(uint8_t Data)
//{
//  /* Send the byte */
//  return (SPIx_Write(Data));
//}
//
///**
//  * @brief  Read a byte from the FLASH SPI.
//  * @retval uint8_t (The received byte).
//  */
//uint8_t FLASH_SPI_IO_ReadByte(void)
//{
//  uint8_t data = 0;
//
//  /* Get the received data */
//  data = SPIx_Read();
//
//  /* Return the shifted data */
//  return data;
//}
//
///**
//  * @brief  Read data from FLASH SPI driver
//  * @param  MemAddress: Internal memory address
//  * @param  pBuffer: Pointer to data buffer
//  * @param  BufferSize: Amount of data to be read
//  * @retval HAL_StatusTypeDef HAL Status
//  */
//HAL_StatusTypeDef FLASH_SPI_IO_ReadData(uint32_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
//{
//  /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_LOW();
//
//  /*!< Send "Read from Memory " instruction */
//  SPIx_Write(FLASH_SPI_CMD_READ);
//
//  /*!< Send ReadAddr high nibble address byte to read from */
//  SPIx_Write((MemAddress & 0xFF0000) >> 16);
//  /*!< Send ReadAddr medium nibble address byte to read from */
//  SPIx_Write((MemAddress& 0xFF00) >> 8);
//  /*!< Send ReadAddr low nibble address byte to read from */
//  SPIx_Write(MemAddress & 0xFF);
//
//  while (BufferSize--) /*!< while there is data to be read */
//  {
//    /*!< Read a byte from the FLASH */
//    *pBuffer = SPIx_Write(FLASH_SPI_DUMMY_BYTE);
//    /*!< Point to the next location where the byte read will be saved */
//    pBuffer++;
//  }
//
//  /*!< Deselect the FLASH: Chip Select high */
//  FLASH_SPI_CS_HIGH();
//
//  return HAL_OK;
//}
//
///**
//  * @brief  Select the FLASH SPI and send "Write Enable" instruction
//  */
//void FLASH_SPI_IO_WriteEnable(void)
//{
//  /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_LOW();
//
//  /*!< Send "Write Enable" instruction */
//  SPIx_Write(FLASH_SPI_CMD_WREN);
//
//  /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_HIGH();
//
//    /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_LOW();
//}
//
///**
//  * @brief  Wait response from the FLASH SPI and Deselect the device
//  * @retval HAL_StatusTypeDef HAL Status
//  */
//HAL_StatusTypeDef FLASH_SPI_IO_WaitForWriteEnd(void)
//{
//  /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_HIGH();
//
//  /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_LOW();
//
//  uint8_t flashstatus = 0;
//
//  /*!< Send "Read Status Register" instruction */
//  SPIx_Write(FLASH_SPI_CMD_RDSR);
//
//  /*!< Loop as long as the memory is busy with a write cycle */
//  do
//  {
//    /*!< Send a dummy byte to generate the clock needed by the FLASH
//    and put the value of the status register in FLASH_Status variable */
//    flashstatus = SPIx_Write(FLASH_SPI_DUMMY_BYTE);
//
//  }
//  while ((flashstatus & FLASH_SPI_WIP_FLAG) == SET); /* Write in progress */
//
//  /*!< Deselect the FLASH: Chip Select high */
//  FLASH_SPI_CS_HIGH();
//
//  return HAL_OK;
//}
//
///**
//  * @brief  Reads FLASH SPI identification.
//  * @retval FLASH identification
//  */
//uint32_t FLASH_SPI_IO_ReadID(void)
//{
//  uint32_t Temp = 0, Temp0 = 0, Temp1 = 0, Temp2 = 0;
//
//  /*!< Select the FLASH: Chip Select low */
//  FLASH_SPI_CS_LOW();
//
//  /*!< Send "RDID " instruction */
//  SPIx_Write(0x9F);
//
//  /*!< Read a byte from the FLASH */
//  Temp0 = SPIx_Write(FLASH_SPI_DUMMY_BYTE);
//
//  /*!< Read a byte from the FLASH */
//  Temp1 = SPIx_Write(FLASH_SPI_DUMMY_BYTE);
//
//  /*!< Read a byte from the FLASH */
//  Temp2 = SPIx_Write(FLASH_SPI_DUMMY_BYTE);
//
//  /*!< Deselect the FLASH: Chip Select high */
//  FLASH_SPI_CS_HIGH();
//
//  Temp = (Temp0 << 16) | (Temp1 << 8) | Temp2;
//
//  return Temp;
//}
//#endif /* HAL_SPI_MODULE_ENABLED */
//
//#ifdef HAL_I2C_MODULE_ENABLED
///********************************* LINK I2C TEMPERATURE SENSOR *****************************/
///**
//  * @brief  Initializes peripherals used by the I2C Temperature Sensor driver.
//  */
//void TSENSOR_IO_Init(void)
//{
//  I2Cx_Init();
//}
//
///**
//  * @brief  Writes one byte to the TSENSOR.
//  * @param  DevAddress: Target device address
//  * @param  pBuffer: Pointer to data buffer
//  * @param  WriteAddr: TSENSOR's internal address to write to.
//  * @param  Length: Number of data to write
//  */
//void TSENSOR_IO_Write(uint16_t DevAddress, uint8_t* pBuffer, uint8_t WriteAddr, uint16_t Length)
//{
//  I2Cx_WriteBuffer(DevAddress, WriteAddr, I2C_MEMADD_SIZE_8BIT, pBuffer, Length);
//}
//
///**
//  * @brief  Reads one byte from the TSENSOR.
//  * @param  DevAddress: Target device address
//  * @param  pBuffer : pointer to the buffer that receives the data read from the TSENSOR.
//  * @param  ReadAddr : TSENSOR's internal address to read from.
//  * @param  Length: Number of data to read
//  */
//void TSENSOR_IO_Read(uint16_t DevAddress, uint8_t* pBuffer, uint8_t ReadAddr, uint16_t Length)
//{
//  I2Cx_ReadBuffer(DevAddress, ReadAddr, I2C_MEMADD_SIZE_8BIT, pBuffer, Length);
//}
//
///**
//* @brief  Checks if Temperature Sensor is ready for communication.
//  * @param  DevAddress: Target device address
//  * @param  Trials: Number of trials
//* @retval HAL status
//*/
//uint16_t TSENSOR_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
//{
//  return (I2Cx_IsDeviceReady(DevAddress, Trials));
//}
//
///********************************* LINK AUDIO ***********************************/
//
///**
//  * @brief  Initializes Audio low level.
//  */
//void AUDIO_IO_Init (void)
//{
//  GPIO_InitTypeDef  gpioinitstruct = {0};
//
//  /* Enable Reset GPIO Clock */
//  AUDIO_RESET_GPIO_CLK_ENABLE();
//
//  /* Audio reset pin configuration -------------------------------------------------*/
//  gpioinitstruct.Pin   = AUDIO_RESET_PIN;
//  gpioinitstruct.Mode  = GPIO_MODE_OUTPUT_PP;
//  gpioinitstruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
//  gpioinitstruct.Pull  = GPIO_NOPULL;
//  HAL_GPIO_Init(AUDIO_RESET_GPIO, &gpioinitstruct);
//
//  I2Cx_Init();
//
//  /* Power Down the codec */
//  HAL_GPIO_WritePin(AUDIO_RESET_GPIO, AUDIO_RESET_PIN, GPIO_PIN_RESET);
//
//  /* wait for a delay to insure registers erasing */
//  HAL_Delay(5);
//
//  /* Power on the codec */
//  HAL_GPIO_WritePin(AUDIO_RESET_GPIO, AUDIO_RESET_PIN, GPIO_PIN_SET);
//
//  /* wait for a delay to insure registers erasing */
//  HAL_Delay(5);
//}
//
///**
//  * @brief  DeInitializes Audio low level.
//  * @note   This function is intentionally kept empty, user should define it.
//  */
//void AUDIO_IO_DeInit(void)
//{
//
//}
//
///**
//  * @brief  Writes a single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @param  Value: Data to be written
//  */
//void AUDIO_IO_Write (uint8_t Addr, uint8_t Reg, uint8_t Value)
//{
//  I2Cx_WriteData(Addr, Reg, Value);
//}
//
///**
//  * @brief  Reads a single data.
//  * @param  Addr: I2C address
//  * @param  Reg: Reg address
//  * @retval Data to be read
//  */
//uint8_t AUDIO_IO_Read (uint8_t Addr, uint8_t Reg)
//{
//  return I2Cx_ReadData(Addr, Reg);
//}
//
//#endif /* HAL_I2C_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
